//2) შექმენით for ციკლი javascript-ში რომელიც გამოიტანს რიცხვებს 1-იდან 30-მდე, შემდეგ ახალი for ციკლი რომელიც გამოიტანს კენტ რიცხვებს 5-იდან 40-მდე, ასევე for ციკლი რომელიც გამოიტანს რიცხვებს 20-იდან 0-მდე, კომენტარებით დაწერეთ რა არის for of და for in ციკლები

for (let i = 0; i <= 30; i++) {
    console.log(i)
}

for (let i = 5; i <= 40; i++) {
    if (i % 2 !== 0) {
        console.log(i)
    }
}

for (let i = 20; i >= 0; i--) {
    console.log(i)
}

// for of - ელემენტების საიტერაციო
// for in - ობიექტების/სიების საიტერაციო