//1) დაწერეთ რა არის პრიმიტიული და კომპლექსური მნიშვნელობები, ასევე თქვენი სიტყვებით ახსენით რა არის stack & heap მეხსიერებები მოიყვანეთ მაგალითი თითოეულზე. საბოლოოდ დაწერეთ რა არის memory leak და აიღეთ ერთ-ერთი მაგალითი (არ გაუშავთ)

// პრიმიტიული მნიშვნელობა არის მარტივი მნიშვნელობა მაგალითად ცვლადი, ინტეჯერი, ბულეანი

let a = 'deme'
a = 'notdeme'
console.log(a)

// კომპლექსური მნიშვნელობა არის რთული მნიშვნელობა მაგალითად მასივი, ობიექტი, ფუნქცია
let numbers = [1, 2, 3, 4, 5]

let info = {
    name: 'deme',
    age: 14,
}

// stack მეხსიერებაში ინახება პატარა მოცულობის და მარტივი მონაცემები (პრიმიტივები)
// heap მეხსიერებაში ინახება კომპლექსური ტიპის მონაცემები

// memory leak როდესაც არა საჭირო ობიექტი რჩება კოდში და უმნიშვნელოდ ხარჯავს მეხსიერებას

function memoryLeak() {
    let array = [];
    return function() {
        array.push('memory leak')
    }
}