"""შექმენით mybalance-ის ცვლადი, შემდეგ გაზარდეთ ამ ცვლადის მნიშვნელობა 2-თ უბრალო ფორმით, შემდეგ ისევ გაზარდეთ მნიშვნელობა 3-ით ოღონდ გამოიყენეთ assigment operator, ამის შემდეგ თქვენი სურვილისამებრ შეცვალეთ ცვლადის მნიშვნელობა იგივე assingment operator-ის საშვალებით, კოდი ახსენით კომენატრებით, ჩამოწერეთ ყველა საუკეტესო პრაქტიკა და მიუწერეთ განმარტებები"""
#გვაქვს ცვლადი რომლის მნიშვნელობაა 470
My_balance = 470
#ცვლადს ვუმატებთ 50-ს ჩვეულებრივ
My_balance = My_balance + 50
#შემდეგ ვუმატებთ 100-ს და 200-ს Assignment Operator-ით
My_balance += 200
#და საბოლოოდ ცვლადის მნიშვნელობა გამოგვაქ ტერმინალში print-ის საშუალებით
print(My_balance)