"""გააკეთეთ პროგრამა რომელშიც გექნებათ ცვლდი სადაც შეინახავთ თქვენს hobby-ის, ასევე შექმენით string ტიპის ცვლადი რომელშიც შეინახვათ თქვენთვის სასურველ მესიჯს, შემდეგ ეს ორი ტექსტი დაბეჭდეთ ერთად, ასევე აიღეთ 2 integer ტიპის ცვლადი და დაბეჭდეთ მათი შეკრებაც, თქვენი სიტყვებით ახსენით რა განსხვავებაა ამ ორი სხვადასხვა ტიპის ცვლადების დამატების ოპერაციებს შორის, რა ეწოდება თითოეულ მოვლენას"""
Hobby = "playing football."
hobby = "I love"
My_Team = "i currently play for FC Avchala"
print(hobby + Hobby + My_Team)

#შეგვიძლია ორნაირად მივუმატოთ ერთმანეთს ინტეჯერები მაგრამ მათ შორის განსხვავებაა
#print("10" + "5") ამით ჩვენ ინტეჯერებს გადავაქცევთ სტრინგებად და პროგრამა გამოიტანს მათ ერთმანეთის გვერდით, არ შეასრულებს ოპერაციას
#ხოლო print(10 + 5) აქ შეასრულებს მათემატიკურ მოქმედებას და გამოიტანს 15-ს