'''2) კომენტარებით ახსენით რა არის მაღალი იერარქიის ფუნქცია, რა არის წმინდა და არაწმინდა ფუნქცია. მოიყვანეთ თითოეულის მაგალითი'''

# მაღალი იერარქიის ფუნქცია არის ფუნქცია რომლის შიგნით არის ფუნქციები

def welcome():
    print('Welcome')

def greet(name):
    print(f"{welcome()} {name}")

# წმინდა ფუნქცია არის ფუნქცია რომელშიც გამოიყენება მხოლოდ ის მონაცემები რომელიც მის შიგნითაა და არაფერი მის გარედან
def add():
    a = 1
    b = 2
    print(a + b)

# არაწმინდა ფუნქცია არის ფუნქცია რომელიც დამოკიდებულია მონაცემებზე მის გარედან ანუ გარე-ფაქტორებზე

num1 = 10
num2 = 20

def add1():
    print(num1 + num2)


greet('demetre')