/*3) შექმენით ნებისმიერ ფუნქცია, რომელსაც გამოიძახებთ ყოველ 3 წამში ერთხელ, შემდეგ ეს ისტრუქცია დააკომენტარეთ და ფუნქცია გამოძახეთ ერთხელ ინსტრუქციის წაკითხვიდან 4 წამის შემდეგ, 
კომენტარებით ახსენით როგორ მუშაობს setInterval და setTimeout ფუნქციები*/

function greet(name) {
    console.log(`Hello ${name}`)
}

// setInterval(greet, 3000)

// setInterval - იძახებს ფუნქციას ყოველი მითითებული ინტერვალით
// setTimeout - იძახებს ფუნქციას მხოლოდ ერთხელ ინტერვალის გასვლის შემდეგ

setTimeout(greet, 4000)