<<<<<<< HEAD
nums = [7, 34, 8, 1, 60, 56, 9]

def insert_sort(arr):
  # ვიწყებთ მეორე ელემენტიდან
  for i in range(1, len(arr)):

    # ვიმახსოვრებთ მიმდინარე ელემენტს
    k = arr[i]

    # j არის ინდექსი მარცხენა ელემენტისთვის
    j = i - 1
    
    # სანამ j არ არის უარყოფით და მარცხენა ელემენტი მეტია k-ზე
    while j >= 0 and arr[j] > k:
      
      # გადაგვაქვს დიდი ელემენტი ერთით მარჯვნივ
      arr[j + 1] = arr[j]

      # გადავდივართ შემდეგ მარცხენა ელემენტზე
      j -= 1

    # k-ს ვსვამთ მის იმ პოზიციაზე სადაც მის მარცხნივ ელემენტები მასზე პატარაა ხოლო მარჯვნინვ მასზე დიდი
    arr[j + 1] = k

  # ვაბრუნებთ დალაგებულ სიას
  return arr

=======
nums = [7, 34, 8, 1, 60, 56, 9]

def insert_sort(arr):
  # ვიწყებთ მეორე ელემენტიდან
  for i in range(1, len(arr)):

    # ვიმახსოვრებთ მიმდინარე ელემენტს
    k = arr[i]

    # j არის ინდექსი მარცხენა ელემენტისთვის
    j = i - 1
    
    # სანამ j არ არის უარყოფით და მარცხენა ელემენტი მეტია k-ზე
    while j >= 0 and arr[j] > k:
      
      # გადაგვაქვს დიდი ელემენტი ერთით მარჯვნივ
      arr[j + 1] = arr[j]

      # გადავდივართ შემდეგ მარცხენა ელემენტზე
      j -= 1

    # k-ს ვსვამთ მის იმ პოზიციაზე სადაც მის მარცხნივ ელემენტები მასზე პატარაა ხოლო მარჯვნინვ მასზე დიდი
    arr[j + 1] = k

  # ვაბრუნებთ დალაგებულ სიას
  return arr

>>>>>>> 65faaba9bc09cf6dcbb40c514a9b58b45e705cc4
print(insert_sort(nums))