'''3) ჩამოწერეთ IndexError, NameError, SyntaxError, ZeroDivisionError გამოწვევის მიზეზები. ასევე ახსენით თქვენი სიტყვებით რა გასნხვავებაა Bug-ს და Error-ს შორის. ახსენით რა არის error handling და მისი თითოეული keyword: try, except, else, finally. შემდეგ მოიყვანეთ ერთი error handling მაგალითი რომელშიც იქნება ყველა error handling-ის keyword'''

# IndexError გამოწვევის მიზეზი - როდესაც ისეთ ინდექსს გამოვიყენებთ რომელიც არ არსებობს
# NameError გამოწვევის მიზეზი - როდესაც არ არსებობს ცვლადი ან ფუნქცია იმ სახელით რომელსაც ჩვენ ვიყენებთ 
# SyntaxError გამოწვევის მიზეზი - როდესაც სინტაქსის წერისას შეცდომას ვუშვებთ
# ZeroDivisionError - როდესაც რამეს ნულზე ვყოფთ

# Error არის როდესაც კოდი წყვეტს მუშაობას ხოლო Bug როდესაც ის ისე არ მუშაობს როგორც უნდა მუშაობდეს

# ErrorHandling - ხელსაწყოები პითონში რომლებიც Error-ების მოგვარებაში გვეხმარება

# try - ვიყენებთ მაშინ როდესაც გვგგონია რომ კოდი error-ს გამოიწვევს
# except - მასში ვწერთ იმ კოდს რომელიც უნდა გაეშვას იმ შემთხვევაში თუ try-ში error აღმოჩნდა
# else - გაეშვება იმ შემთხვევაში თუ except ბლოკი არ გაეშვა, ანუ try ბლოკში error არ არის
# finally - საბოლოო კოდის ბლოკი რომელიც ყველა შემთხვევაში გაეშვება

try:
    name = 'Demetre'
    print(name)
    print(name[14])
except:
    try:
        print(13 / 0)
    except:
        print('Error-ი Error-ში')
    else:
        print('არანაირი Error')
    finally:
        print('საბოლოო კოდი')